&НаКлиенте
Процедура Процедура1(Парам) 
	а =1 ;	
КонецПроцедуры

&НаСервере
Процедура Процедура3(Парам1, Парам2)
	а =1 ;	
КонецПроцедуры

&НаСервере
Процедура Процедура2()
	а =1 ;	
КонецПроцедуры

&НаСервере
Функция Функция1(Парам)
	а =1 ;
КонецФункции

&НаСервере
Функция Функция2(Парам1, Парам2)
	а =1 ;	
КонецФункции

&НаСервере
Функция Функция3()
	а =1 ;	
КонецФункции

&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
