
Процедура ПодпискаНаСобытие1ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Сообщить("");
	
КонецПроцедуры


Процедура Процедура1(Парам) Экспорт
	
КонецПроцедуры

Процедура Процедура3(Парам1, Парам2)
	
КонецПроцедуры

Процедура Процедура2()
	
КонецПроцедуры


Функция Функция1(Парам)
	
КонецФункции


Функция Функция2(Парам1, Парам2)
	
КонецФункции


Функция Функция3()
	
КонецФункции

Функция ШаблонURL1Метод2(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция ШаблонURL1Метод1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
