//
// Тест
//
Перем Тест;

#Область Тест

#Если ВебКлиент Тогда

&НаКлиенте
Процедура Процедура1(Парам) Экспорт
	
КонецПроцедуры

#КонецЕсли

//
// Test
//
//
//
&НаСервере
&Вместо("ОрганизацияПриИзмененииНаСервере")
Процедура Процедура3(Парам1, Парам2) Экспорт

	#Если ВебКлиент Тогда
	    а=1;
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

Процедура Процедура2()
	
КонецПроцедуры

Функция Функция1(Парам)
	
КонецФункции

Функция Функция2(Парам1, Парам2)
	
КонецФункции


Функция Функция3()
	
КонецФункции

Тест = 1;